In [106]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sb

In [128]:
# To read data frame
Data1=pd.DataFrame(pd.read_csv('/content/train (1).csv'))

In [129]:
Data1

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [109]:
# To get fist 5 data information
Data1.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [110]:
# To get last 5 data information
Data1.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [111]:
# To get number of columns and rows
Data1.shape

(891, 12)

In [152]:
# To get column names
Data1.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Ticket',
       'Fare', 'Cabin', 'Embarked', 'FamilySize', 'Alone'],
      dtype='object')

In [153]:
# To get rows information
Data1.index

RangeIndex(start=0, stop=891, step=1)

In [112]:
# To get all null values
x=Data1.isnull().sum()
x

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [113]:
drop_col=x[x>(35/100*Data1.shape[0])]
drop_col

Cabin    687
dtype: int64

In [114]:
Data1.drop(drop_col.index, axis=1, inplace=True)

In [115]:
Data1.fillna(Data1.mean(),inplace=True)
Data1.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [116]:
# To get information about Embaked columns
Data1['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [117]:
Data1['Embarked'].fillna('S',inplace=True)
Data1.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [118]:
# To get corrlation between other columns
Data1.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

In [137]:
Data1['FamilySize']=Data1['SibSp']+Data1['Parch']

In [140]:
Data1.drop(['SibSp','Parch'],axis=1,inplace=True)

In [143]:
Data1.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.036847  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.077221  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.369226 -0.549500    0.065997
Age             0.036847 -0.077221 -0.369226  1.000000  0.096067   -0.301914
Fare            0.012658  0.257307 -0.549500  0.096067  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997 -0.301914  0.217138    1.000000

In [145]:
Data1['Alone']=[0 if Data1['FamilySize'][i]>0 else 1 for i in Data1.index]
Data1.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          1      0
1            2         1       1  ...        C          1      0
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          1      0
4            5         0       3  ...        S          0      1

[5 rows x 12 columns]

In [147]:
Data1.tail()

     PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
886          887         0       2  ...        S          0      1
887          888         1       1  ...        S          0      1
888          889         0       3  ...        S          3      0
889          890         1       1  ...        C          0      1
890          891         0       3  ...        Q          0      1

[5 rows x 12 columns]

In [148]:
Data1.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

In [149]:
Data1.groupby(['Sex'])['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [150]:
Data1.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

In [151]:
Data1.groupby(['Pclass'])['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [ ]:
# CONCLUSION
# There is 891 rows and 12 columns
# When we onsider the corrilation between other colums then nwe can see there is a good corrilation between Pclass and Fare value, that mean if Pclass is increase then Fare value is decrease.
# We can, if person is alone then they have less chance of surviving.
# And also Femeals passengers have more chance of surviving than males.
# We see that the precentage of survive was more for Embarked is "C" and survive was minimum for Embarked is "S".
# finaly we can say that the Pclass 1 has hige chance to survived and less chance to survive Pclass is 3